In [2]:
import pandas as pd
upozila = 'Gaibandha' #status-done
upozila = 'Faridpur' # status - done
upozila = 'Feni' # status - done
upozila = 'Gazipur' # status - done
upozila = 'Gopalgonj' # status - done
upozila = 'Habiganj' # status - done
upozila = 'Jamalpur' # status - done
upozila = 'Jessore' # status - done
upozila = 'Jhalkathi' # status - done
upozila = 'Jhinaidaha'
filepath = 'cleaned_CSVs/' + upozila + '/'

# data = pd.read_csv(filename, skiprows=3, header=None, usecols=[1, 2, 3, 4])

In [ ]:
# data.to_csv('test.csv')

In [3]:
import glob
txtfiles = []
for file in glob.glob(filepath  + '*.csv'):
    txtfiles.append(file)
len(txtfiles)

166

In [8]:
index = 0
filename = txtfiles[index]
data = pd.read_csv(filename, index_col=0)
data

,0,1,2,3,4,5,6
0,"Area and production of pepper, onion and garli...",NaN,NaN,NaN,NaN,NaN,NaN
1,(Area in acre and production in metric ton),NaN,NaN,NaN,NaN,NaN,NaN
2,Upazila,Pepper Area,Pepper Production,Onion Area,Onion Production,Garlic Area,Garlic Production
3,Harinakunda,57,171,320,1408,195,585
4,Jhenaidah Sadar,556,1322,420,1800,220,630
5,Kaliganj,156,273,365,1059,167,323
6,Kotchandpur,191,446,402,1600,137,342
7,Mahespur,728,2581,900,3600,450,1260
8,Shailkupa,1449,3336,13500,50625,1330,29526
9,Total,3137,8129,15907,60092,2499,32666

In [11]:
# Extract last column
total = data.iloc[[-1]]
total

       0     1     2      3      4     5      6
9  Total  3137  8129  15907  60092  2499  32666

In [26]:
# Extract all but last column
data_total = data.iloc[3:-1, 1:7]
data_total

      1     2      3      4     5      6
3    57   171    320   1408   195    585
4   556  1322    420   1800   220    630
5   156   273    365   1059   167    323
6   191   446    402   1600   137    342
7   728  2581    900   3600   450   1260
8  1449  3336  13500  50625  1330  29526

In [27]:
data_total.astype(float).sum()

1     3137.0
2     8129.0
3    15907.0
4    60092.0
5     2499.0
6    32666.0
dtype: float64